# GetLayer

## Description
Function GetLayer returns a handle to the layer of the referenced object. &lt;BR&gt;
&lt;BR&gt;

```pascal
FUNCTION GetLayer(h : HANDLE) : HANDLE;
```

```python

def vs.GetLayer(h):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## Examples
```pascal
LayerHandle:=GetLayer(ObjHd);

```

## Version
Availability: from MiniCAD
## Category
* Layers